Revit 2027 API
Material.MaterialClass Property
 The name of the general material type, e.g. 'Wood.'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string MaterialClass { get; set; }
Public Property MaterialClass As String
	Get
	Set
public:
property String^ MaterialClass {
	String^ get ();
	void set (String^ value);
}
member MaterialClass : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace